AxDen-Dev/NRF52_Smart_Agriculture_example/main.c
	sd_power_dcdc_mode_set(NRF_POWER_DCDC_ENABLE);

#endif

}

static void log_init(void) {
	ret_code_t err_code = NRF_LOG_INIT(NULL);
	APP_ERROR_CHECK(err_code);

	NRF_LOG_DEFAULT_BACKENDS_INIT();
}

/**@brief Function for initializing power management.
 */
static void power_management_init(void) {
	ret_code_t err_code;
	err_code = nrf_pwr_mgmt_init();
	APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void) {
	if (NRF_LOG_PROCESS() == false) {
		nrf_pwr_mgmt_run();
	}
}

static void wait_200ms() {

	for (uint8_t i = 0; i < 2; i++) {

		while (!app_timer_update) {

			idle_state_handle();

		}

		app_timer_update = 0x00;

	}

}

static void get_mac_address() {

	uint32_t err_code;
	ble_gap_addr_t addr;

	err_code = sd_ble_gap_addr_get(&addr);
	APP_ERROR_CHECK(err_code);

	for (uint8_t i = 0; i < 6; i++) {

		mac_address[5 - i] = addr.addr[i];

	}

}

static void saadc_callback(nrf_drv_saadc_evt_t const *p_event) {

	if (p_event->type == NRF_DRV_SAADC_EVT_DONE) {

		ret_code_t err_code;

		err_code = nrf_drv_saadc_buffer_convert(p_event->data.done.p_buffer,
		SAADC_SAMPLES_IN_BUFFER);
		APP_ERROR_CHECK(err_code);

		int32_t adc_0_value = p_event->data.done.p_buffer[0];

		float battery = (float) adc_0_value / 255;
		battery = battery * 3.6;
		battery *= 3.0;
		battery_value = (uint8_t) (battery * 10);

		nrf_drv_saadc_uninit();

		NRF_SAADC->INTENCLR = (SAADC_INTENCLR_END_Clear
				<< SAADC_INTENCLR_END_Pos);
		NVIC_ClearPendingIRQ(SAADC_IRQn);

		m_saadc_initialized = 0x00;

		NRF_LOG_INFO("BAT %d", battery_value);
		NRF_LOG_FLUSH();

	}

}

static void saadc_init(void) {

	ret_code_t err_code;
	nrf_drv_saadc_config_t saadc_config;
	nrf_saadc_channel_config_t channel_config0;

	saadc_config.resolution = NRF_SAADC_RESOLUTION_8BIT;
	saadc_config.oversample = NRF_SAADC_OVERSAMPLE_DISABLED;
	saadc_config.interrupt_priority = APP_IRQ_PRIORITY_LOW;

	err_code = nrf_drv_saadc_init(&saadc_config, saadc_callback);
	APP_ERROR_CHECK(err_code);

	channel_config0.reference = NRF_SAADC_REFERENCE_INTERNAL;
	channel_config0.gain = NRF_SAADC_GAIN1_6;
	channel_config0.acq_time = NRF_SAADC_ACQTIME_10US;
	channel_config0.mode = NRF_SAADC_MODE_SINGLE_ENDED;
	channel_config0.pin_p = NRF_SAADC_INPUT_AIN3;
	channel_config0.pin_n = NRF_SAADC_INPUT_DISABLED;
	channel_config0.resistor_p = NRF_SAADC_RESISTOR_DISABLED;
	channel_config0.resistor_n = NRF_SAADC_RESISTOR_DISABLED;

	err_code = nrf_drv_saadc_channel_init(0, &channel_config0);
	APP_ERROR_CHECK(err_code);

	err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool_low_power[0],
	SAADC_SAMPLES_IN_BUFFER);
	APP_ERROR_CHECK(err_code);

	err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool_low_power[1],
	SAADC_SAMPLES_IN_BUFFER);
	APP_ERROR_CHECK(err_code);

}

static void read_battery_level(void) {

	if (!m_saadc_initialized) {

		saadc_init();

	}

	m_saadc_initialized = 0x01;

	nrf_drv_saadc_sample();

	while (m_saadc_initialized) {

		idle_state_handle();

	}

	nrf_gpio_pin_clear(GPIO_BAT_EN);

}

static void twi_scan(void) {

	NRF_LOG_INFO("I2C Scan started.");

	for (uint16_t i = 0; i < 127; i++) {

		uint8_t reg = 0x01;
		uint8_t twi_timeout = 5;

		twi_write_done = 0x00;
		twi_read_done = 0x00;
		twi_address_nack = 0x00;

		nrf_drv_twi_tx(&m_twi, i, &reg, 1, false);

		while (!twi_write_done && --twi_timeout) {

			idle_state_handle();

		}

		if (!twi_address_nack) {

			set_uart_usb_in_out_find_i2c_address(i);

			NRF_LOG_INFO("FIND %02X", i);

		}

		NRF_LOG_FLUSH();

	}

}

static void twi_handler(nrf_drv_twi_evt_t const *p_event, void *p_context) {

	switch (p_event->type) {

	case NRF_DRV_TWI_EVT_DONE:

		twi_write_done = 0x01;
		twi_read_done = 0x01;

		break;

	default:
//	    NRF_DRV_TWI_EVT_ADDRESS_NACK,
//	    NRF_DRV_TWI_EVT_DATA_NACK

		twi_write_done = 0x01;
		twi_read_done = 0x01;
		twi_address_nack = 0x01;

		break;

	}

}

static void twi_init(void) {

	ret_code_t err_code;

	const nrf_drv_twi_config_t twi_config =
			{ .scl = I2C_SCL_GPIO, .sda = I2C_SDA_GPIO, .frequency =
					NRF_DRV_TWI_FREQ_400K, .interrupt_priority =
					APP_IRQ_PRIORITY_HIGH, .clear_bus_init = false };

	err_code = nrf_drv_twi_init(&m_twi, &twi_config, twi_handler, NULL);
	APP_ERROR_CHECK(err_code);

	nrf_drv_twi_enable(&m_twi);

}

static void uart_event_handle(app_uart_evt_t *p_event) {

	switch (p_event->evt_type) {

	case APP_UART_DATA_READY: {
		uint8_t data;
		UNUSED_VARIABLE(app_uart_get(&data));

	}

		break;

	case APP_UART_DATA: {
		uint8_t data;
		UNUSED_VARIABLE(app_uart_get(&data));

		break;

	}

	case APP_UART_COMMUNICATION_ERROR: {

		NRF_LOG_ERROR("COMM ERROR");
		app_uart_flush();

	}
		break;

	case APP_UART_FIFO_ERROR: {

		NRF_LOG_ERROR("FIFO ERROR");
		app_uart_flush();

	}
		break;

	default:
		break;
	}

}

static void init_uart_2() {

	uint32_t err_code;

	const app_uart_comm_params_t comm_params = { .rx_pin_no = UART_2_RX_GPIO,
			.tx_pin_no = UART_2_TX_GPIO, UART_PIN_DISCONNECTED,
			UART_PIN_DISCONNECTED, .flow_control =
					APP_UART_FLOW_CONTROL_DISABLED, .use_parity = false,
			NRF_UART_BAUDRATE_9600 };

	APP_UART_FIFO_INIT(&comm_params, 256, 256, uart_event_handle,
			APP_IRQ_PRIORITY_LOWEST, err_code);

	APP_ERROR_CHECK(err_code);

}

#ifdef NRF528XX_FEM

void fem_init(void) {

	ret_code_t err_code;
	ble_opt_t opt;
	uint32_t gpiote_ch;
	nrf_ppi_channel_t ppi_set_ch;
	nrf_ppi_channel_t ppi_clr_ch;
	nrf_drv_gpiote_out_config_t config = GPIOTE_CONFIG_OUT_TASK_TOGGLE(false);

	nrf_gpio_cfg_output(FEM_ANT_SEL);
	nrf_gpio_pin_clear(FEM_ANT_SEL);

	nrf_gpio_cfg_output(FEM_CSD);
	nrf_gpio_pin_set(FEM_CSD);

	nrf_gpio_cfg_output(FEM_CHL);
	nrf_gpio_pin_set(FEM_CHL);

	nrf_gpio_cfg_output(FEM_CPS);

