AxDen-Dev/NRF52_Smart_Agriculture_example/main.c
	nrf_gpio_pin_clear(FEM_CPS);

	nrf_gpio_cfg_output(FEM_CTX);
	nrf_gpio_pin_clear(FEM_CTX);

	nrf_gpio_cfg_output(FEM_CRX);
	nrf_gpio_pin_clear(FEM_CRX);

	err_code = nrf_drv_gpiote_init();

	if (err_code != NRF_ERROR_INVALID_STATE) {

		APP_ERROR_CHECK(err_code);

	}

	err_code = nrf_drv_ppi_init();

	if (err_code != NRF_ERROR_INVALID_STATE) {

		APP_ERROR_CHECK(err_code);

	}

	err_code = nrf_drv_ppi_channel_alloc(&ppi_set_ch);
	APP_ERROR_CHECK(err_code);

	err_code = nrf_drv_ppi_channel_alloc(&ppi_clr_ch);
	APP_ERROR_CHECK(err_code);

	err_code = nrf_drv_gpiote_out_init(FEM_CRX, &config);
	APP_ERROR_CHECK(err_code);

	gpiote_ch = nrf_drv_gpiote_out_task_addr_get(FEM_CRX);

	memset(&opt, 0, sizeof(ble_opt_t));
	opt.common_opt.pa_lna.gpiote_ch_id = (gpiote_ch - NRF_GPIOTE_BASE) >> 2; // GPIOTE channel used for radio pin toggling
	opt.common_opt.pa_lna.ppi_ch_id_clr = ppi_clr_ch; // PPI channel used for radio pin clearing
	opt.common_opt.pa_lna.ppi_ch_id_set = ppi_set_ch; // PPI channel used for radio pin setting

	opt.common_opt.pa_lna.pa_cfg.active_high = 1; // Set the pin to be active high
	opt.common_opt.pa_lna.pa_cfg.enable = 1;              // Enable toggling
	opt.common_opt.pa_lna.pa_cfg.gpio_pin = FEM_CTX; // The GPIO pin to toggle

	opt.common_opt.pa_lna.lna_cfg.active_high = 1; // Set the pin to be active high
	opt.common_opt.pa_lna.lna_cfg.enable = 1;             // Enable toggling
	opt.common_opt.pa_lna.lna_cfg.gpio_pin = FEM_CRX; // The GPIO pin to toggle

	err_code = sd_ble_opt_set(BLE_COMMON_OPT_PA_LNA, &opt);
	APP_ERROR_CHECK(err_code);

}

#endif

static void gpio_init() {

	nrf_gpio_cfg_output(GPIO_LED_0);
	nrf_gpio_pin_clear(GPIO_LED_0);

	nrf_gpio_cfg_output(GPIO_LED_1);
	nrf_gpio_pin_clear(GPIO_LED_1);

	nrf_gpio_cfg_output(GPIO_BAT_EN);
	nrf_gpio_pin_clear(GPIO_BAT_EN);

	nrf_gpio_cfg_output(GPIO_SENSOR_POWER_EN);
	nrf_gpio_pin_clear(GPIO_SENSOR_POWER_EN);

	nrf_gpio_cfg_input(GPIO_BTN, NRF_GPIO_PIN_PULLUP);

}

/**@brief Function for application main entry.
 */
int main(void) {

	uint8_t data_update = 0x00;
	uint8_t battery_read_step = 0x00;

	uint32_t device_id_0 = NRF_FICR->DEVICEID[1];
	uint32_t device_id_1 = NRF_FICR->DEVICEID[0];

	mac_address[0] = device_id_0 >> 24;
	mac_address[1] = device_id_0 >> 16;
	mac_address[2] = device_id_0 >> 8;
	mac_address[3] = device_id_0;

	mac_address[4] = device_id_1 >> 24;
	mac_address[5] = device_id_1 >> 16;
	mac_address[6] = device_id_1 >> 8;
	mac_address[7] = device_id_1;

	log_init();

	timers_init();

	gpio_init();

	twi_init();

	init_uart_2();

	power_management_init();

	ble_stack_init();

#ifdef NRF528XX_FEM

	fem_init();

#endif

	gap_params_init();

	gatt_init();

	services_init();

	advertising_init(cycle_update);

	conn_params_init();

	advertising_start();

	app_timer_start(m_app_timer_id, APP_TIMER_DELAY, NULL);

	set_uart_usb_in_out_write_string("Start AxDen SmartAgriculture example");

	get_mac_address();

	set_uart_usb_in_out_mac_address(mac_address);

	nrf_gpio_pin_set(GPIO_SENSOR_POWER_EN);

	wait_200ms();

	twi_scan();

	set_bme280_twi_instance(m_twi);

	init_bme280();

	wait_200ms();

	get_bme280_temperature(&temperature);

	get_bme280_pressure(&pressure);

	set_hdc1080_twi_instance(m_twi);

	init_hdc1080();

	wait_200ms();

	get_hdc1080_temperature_humidity(&temperature, &humidity);

	set_vcnl4040_twi_instance(m_twi);

	init_vcnl4040();

	wait_200ms();

	get_vcnl4040_ambient_light(&ambient_light);

	nrf_gpio_pin_set(GPIO_BAT_EN);

	wait_200ms();

	read_battery_level();

	NRF_LOG_INFO("Print sensor value");

	set_uart_usb_in_out_battery(battery_value);

	set_uart_usb_in_out_temperature(temperature);

	set_uart_usb_in_out_pressure(pressure);

	set_uart_usb_in_out_humidity(humidity);

	set_uart_usb_in_out_lux(ambient_light);

	NRF_LOG_INFO("Start main loop");

	radio_packet_protocol.Packet.company_id[0] = COMPANY_ID >> 8;
	radio_packet_protocol.Packet.company_id[1] = COMPANY_ID;
	radio_packet_protocol.Packet.device_id[0] = DEVICE_TYPE >> 8;
	radio_packet_protocol.Packet.device_id[1] = DEVICE_TYPE;
	memcpy(radio_packet_protocol.Packet.mac_address, mac_address, 8);
	radio_packet_protocol.Packet.control_number = 0;

	for (;;) {

		if (!nrf_gpio_pin_read(GPIO_BTN)) {

			nrf_gpio_pin_toggle(GPIO_LED_0);

		}

		if (collection_cycle_update) {

			if (battery_read_step == 0x00) {

				nrf_gpio_pin_set(GPIO_BAT_EN);

				battery_read_step = 0x01;

			} else {

				read_battery_level();

				get_bme280_temperature(&temperature);

				get_bme280_pressure(&pressure);

				get_hdc1080_temperature_humidity(&temperature, &humidity);

				get_vcnl4040_ambient_light(&ambient_light);

				set_uart_usb_in_out_battery(battery_value);

				set_uart_usb_in_out_temperature(temperature);

				set_uart_usb_in_out_pressure(pressure);

				set_uart_usb_in_out_humidity(humidity);

				set_uart_usb_in_out_lux(ambient_light);

				payload_size = 0;
				memset(payload, 0x00, sizeof(payload));

				payload_size = sprintf((char*) payload, "%d.%d,",
						(battery_value / 10), (battery_value % 10));

				payload_size += sprintf((char*) payload + payload_size,
						"%d.%d,", (temperature / 10), abs(temperature % 10));

				payload_size += sprintf((char*) payload + payload_size, "%ld,",
						pressure);

				payload_size += sprintf((char*) payload + payload_size, "%d,",
						humidity);

				payload_size += sprintf((char*) payload + payload_size, "%d",
						ambient_light);

				radio_packet_protocol_size = PACKET_HEADER_SIZE;
				radio_packet_protocol_size += payload_size;
				memcpy(radio_packet_protocol.Packet.payload, payload,
						payload_size);

				battery_read_step = 0x00;
				collection_cycle_update = 0x00;

				cycle_update = 0x01;

				if (m_conn_handle == BLE_CONN_HANDLE_INVALID) {

					adversting_stop();

					gap_params_init();

					advertising_init(cycle_update);

					advertising_start();

				}

				data_update = 0x01;

				NRF_LOG_INFO("Data Update");

			}

		}

		if (data_update) {

			if (m_conn_handle != BLE_CONN_HANDLE_INVALID) {

				if (notify_enable_state) {

					if (tx_complete_state == 0x01) {

						tx_complete_state = 0x00;

						ble_service_send_notification(m_conn_handle, &m_service,
								radio_packet_protocol.buffer,
								radio_packet_protocol_size);

						NRF_LOG_INFO("Notify Send");

					} else if (tx_complete_state == 0x02) {

						if (request_disconnect == 0x00) {

							cycle_update = 0x00;

							sd_ble_gap_disconnect(m_conn_handle,
							BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);

							request_disconnect = 0x01;

							NRF_LOG_INFO("Disconnect request");

						}

						data_update = 0x00;

					}

				}

			}

		}

		while (!app_timer_update) {

			idle_state_handle();

		}

		app_timer_update = 0x00;

		nrf_gpio_pin_toggle(GPIO_LED_1);

		NRF_LOG_FLUSH();

	}
}

/**
 * @}
 */
